# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: "/Applications"

brew "python@3.11"

# git
brew "fzf"
brew "gh"
brew "git"
brew "sops"
brew "pre-commit"
brew "ankitpokhrel/jira-cli/jira-cli"

# shell
brew "tree"
brew "btop"
brew "htop"
brew "ncdu"

# network
brew "netcat"
brew "gping"
brew "httpie"
brew "hurl"
brew "rsync"
brew "telnet"
brew "teamookla/speedtest/speedtest"

# work with text
brew "jq"
brew "yq"
brew "difftastic"
brew "homeport/tap/dyff"
brew "gnu-sed"
brew "ripgrep"
brew "yamllint"

# terraform
brew "warrensbox/tap/tfswitch"
brew "terraform-docs"
brew "terragrunt"
brew "tflint"

# k8s
brew "kubectl"
brew "kube-ps1"
brew "tokiwong/tap/helm-switcher"
brew "derailed/k9s/k9s"
brew "orbstack"
brew "kubectx"
brew "kind"
brew "stern"
brew "metalbear-co/mirrord/mirrord"
brew "derailed/popeye/popeye"
brew "transcend-io/tap/terragrunt-atlantis-config"
brew "txn2/tap/kubefwd"
brew "utkuozdemir/pv-migrate/pv-migrate"

# other
brew "postgresql@14"

# casks
cask "visual-studio-code"
cask "google-chrome"
cask "iterm2"
cask "slack"
cask "spotify"
cask "telegram"



# Security
mas "1Password for Safari", id: 1569813296

vscode "4ops.terraform"
vscode "ahmadalli.vscode-nginx-conf"
vscode "raynigon.nginx-formatter"
vscode "eamodio.gitlens"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "ivory-lab.jenkinsfile-support"
vscode "mikestead.dotenv"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "Tim-Koehler.helm-intellisense"
vscode "tsandall.opa"
vscode "zhangciwu.swig-tpl"
