# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: "/Applications"

# prerequisites
tap "homebrew/cask"
tap "buo/cask-upgrade"
brew "mas"

# lang
brew "python@3.11"
brew "go"

# git
brew "fzf"
brew "gh"
brew "git"
brew "sops"
brew "pre-commit"

tap "ankitpokhrel/jira-cli"
brew "jira-cli"

# terminal tools
brew "tree"
brew "btop"
brew "htop"
brew "ncdu"

# network
brew "netcat"
brew "gping"
brew "httpie"
brew "hurl"
brew "rsync"
brew "telnet"

tap "teamookla/speedtest"
brew "speedtest"

# work with text
brew "jq"
brew "yq"
brew "difftastic"

tap "homeport/tap"
brew "dyff"

brew "gnu-sed"
brew "ripgrep"
brew "yamllint"

# terraform
tap "warrensbox/tap"
brew "tfswitch"

brew "terraform-docs"
brew "terragrunt"
brew "tflint"

# k8s
brew "kubectl"
brew "kube-ps1"

tap "tokiwong/tap"
brew "helm-switcher"

tap "derailed/k9s"
brew "k9s"

brew "kubectx"
brew "kind"
brew "stern"

tap "metalbear-co/mirrord"
brew "mirrord"

tap "derailed/popeye"
brew "popeye"

tap "transcend-io/tap"
brew "terragrunt-atlantis-config"

tap "txn2/tap"
brew "kubefwd"

tap "utkuozdemir/pv-migrate"
brew "pv-migrate"

# other
brew "postgresql@14"

# casks
cask "google-cloud-sdk"
cask "orbstack"
cask "visual-studio-code"
cask "google-chrome"
cask "iterm2"
cask "slack"
cask "spotify"
cask "telegram"
cask "spectacle"
cask "setapp"
cask "nordvpn"
cask "1password"
cask "signal"
cask "zoom"

# Mac Apple Store
mas "1Password for Safari", id: 1569813296

vscode "4ops.terraform"
vscode "ahmadalli.vscode-nginx-conf"
vscode "raynigon.nginx-formatter"
vscode "eamodio.gitlens"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "ivory-lab.jenkinsfile-support"
vscode "mikestead.dotenv"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "Tim-Koehler.helm-intellisense"
vscode "tsandall.opa"
vscode "zhangciwu.swig-tpl"
